app/views/books/_index.html.erb

        <td>
          <p>コメント数:<%= book.book_comments.count %></p>
---
SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]